HARDWARE_ANALYSIS_PROMPT = """
请分析这张图片，并提取其中的所有硬件设备及其相关信息，来填写表格，表格有5列：模块/整机 配置 编码 数量 备注。
对于模块/整机，是图中以数字和字母的组合，只有一个。
对于配置，是工控机、网线、串口线、HUB环境交换机、PDU、SFP28 25G工具光模块、QSFP28 100G工具光模块、U盘、风扇模块、AC电源等的名字
对于编码，是配置对应的编码，是字母或者数字，可以没有编码
对于数量，是配置对应的数量，必须有备注
对于备注，是配置对应的备注信息，可以没有备注

补充知识：
1、需要用到一台PC机，一个环境交换机，一个PDU。
2、PC机配置一个网口以及一个串口；网口连接环境交换机，串口连接被测设备。
3、PDU配置一个网口连接环境交换机；PDU同时与被测设备的2个PWR电源连接。
4、被测设备有5个接口，一个USB接口，2个PWR电源接口，1个串口连接PC机，一个网口连接环境交换机。
5、环境交换机用HUB表示，环境交换机用到3个网口分别接PC机、PDU以及被测设备。
6、串口统一用con表示，网口统一用net表示。
7、每轮测试只测1台被测设备。
8、工控机的备注信息是PIII700以上，千兆网卡。工控机没有编码。
9、网线的备注信息是连接交换机、PDU和被测设备软件加载。网线没有编码。
10、串口线的备注信息是连接被测设备串口。串口线没有编码。
11、HUB环境交换机的备注信息是所有端口在同一个VLAN。HUB环境交换机没有编码。
12、PDU的备注信息是给被测设备上下电。PDU没有编码
13、U盘的备注信息是测试USB接口。U盘没有编码。
14、AC电源的备注信息是AC 220V供电。AC电源有编码。
15、风扇有编码。

{query}

输出要求：
{{'configuration': [{{'模块/整机': 'SD6881', '配置': '工控机', '编码': '', '数量': 1, '备注': 'PIII700以上，千兆网卡'}}, {{'模块/整机': 'SD6881', '配置': '网线', '编码': '', '数量': 3, '备注': '连接交换机、PDU和被测设备软件加载'}}, ...]}}
直接返回json。
"""